# ConduitSize Properties

---
The ConduitSize type exposes the following members.
| Name| Description
---|---|---
| BendRadius|  Minimum bend radius
| InnerDiameter|  Inner diameter
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| NominalDiameter|  Nominal diameter
| OuterDiameter|  Outer diameter
| UsedInSizeLists|  Whether it is used in size lists.
| UsedInSizing|  Whether is used in sizing.
Top
#### Reference
ConduitSize Class
Autodesk.Revit.DB.Electrical Namespace